# 参考文献

jupyter使用sql https://blog.csdn.net/qq_29644709/article/details/107284072

# 目录

- [使用pandas处理SQL数据库](#使用pandas处理SQL数据库)
- [直接在jupyter中使用SQL语句](#直接在jupyter中使用SQL语句)
    - [基本查询](#基本查询)
    - [条件查询](#条件查询)
    
- [sql转pandas](#sql转pandas)
- [基本概念](#基本概念)

# 使用pandas处理SQL数据库

In [1]:
# 安装pymysql：pip install pymysql
import pandas as pd
import sqlalchemy as sqla

In [2]:
# 创建连接：root后输mysql数据库密码，@后输入mysql ip地址，斜杠后输数据库名
#db = sqla.create_engine('mysql+pymysql://root:password@ip/databaseName?charset=utf8') 
db = sqla.create_engine('mysql+pymysql://root:xhy12315@localhost/test?charset=utf8') 
db

Engine(mysql+pymysql://root:***@localhost/test?charset=utf8)

In [ ]:
# https://blog.csdn.net/Aifore/article/details/89036882
# 运行以下语句，报错：Unknown system variable 'tx_isolation’
# 原因：Mysql8 has renamed tx_isolation to transaction_isolation，而包暂未更新。
# 处理：
# 方法1，升级包
# 方法2，找到你包的base.py文件，我的文件路径是：/<项目虚拟环境路径>/env/lib/python2.7/site-packages/sqlalchemy/dialects/mysql/base.py
#        查找到tx_isolation，替换成transaction_isolation

In [3]:
# 列出数据库中的所有表
formlist = pd.read_sql_query('show tables',con=db)
print(formlist)

  Tables_in_test
0        classes
1       students

In [5]:
# 查看某张表中的数据
table1= pd.read_sql_table('students',con=db)
table1

   id  class_id      name gender  score
0   1         1  xiaoming      M     90
1   2         1  xiaohong      F     95
2   3         1   xiaojun      M     88
3   4         1    xiaomi      F     73
4   5         2   xiaobai      F     81
5   6         2  xiaobing      M     55
6   7         2   xiaolin      M     85
7   8         3   xiaoxin      F     91
8   9         3  xiaowang      M     89
9  10         3    xiaoli      F     85

In [6]:
# 使用sql语句查询某张表
result = pd.read_sql('select * from students ',con=db)
result

   id  class_id      name gender  score
0   1         1  xiaoming      M     90
1   2         1  xiaohong      F     95
2   3         1   xiaojun      M     88
3   4         1    xiaomi      F     73
4   5         2   xiaobai      F     81
5   6         2  xiaobing      M     55
6   7         2   xiaolin      M     85
7   8         3   xiaoxin      F     91
8   9         3  xiaowang      M     89
9  10         3    xiaoli      F     85

# 直接在jupyter中使用SQL语句

In [9]:
# 本cell的方法为直接使用SQL语句的方法

#PostgreSQL: postgresql://scott:tiger@localhost/mydatabase
#MySQL: mysql://scott:tiger@localhost/foo
#Oracle: oracle://scott:tiger@127.0.0.1:1521/sidname
#SQL Server: mssql+pyodbc://scott:tiger@mydsn
#SQLite: sqlite:///foo.db
%load_ext sql
# No module named 'MySQLdb' 解决办法为 pip install mysqlclient
%sql mysql://root:xhy12315@localhost/test
# 当前连接到root用户的test数据库

以下为，单独执行一个sql语句

In [36]:
%sql show tables
# 显示当前数据库test中的所有表名

 * mysql://root:***@localhost/test
2 rows affected.

[('classes',), ('students',)]

In [37]:
%sql show columns from students
# 显示students表的所有列，其中None在SQL环境中为Null

 * mysql://root:***@localhost/test
5 rows affected.

[('id', 'bigint', 'NO', 'PRI', None, 'auto_increment'),
 ('class_id', 'bigint', 'NO', '', None, ''),
 ('name', 'varchar(100)', 'NO', '', None, ''),
 ('gender', 'varchar(1)', 'NO', '', None, ''),
 ('score', 'int', 'NO', '', None, '')]

## 基本查询

`SELECT * FROM <表名>` 可以查询到一张表的所有记录。

In [43]:
%sql select * from students; 
#SELCET 表示将要执行一个查询。*表示“所有列”，FROM表示将要从哪个表查询，本例中是students表

 * mysql://root:***@localhost/test
10 rows affected.

[(1, 1, 'xiaoming', 'M', 90),
 (2, 1, 'xiaohong', 'F', 95),
 (3, 1, 'xiaojun', 'M', 88),
 (4, 1, 'xiaomi', 'F', 73),
 (5, 2, 'xiaobai', 'F', 81),
 (6, 2, 'xiaobing', 'M', 55),
 (7, 2, 'xiaolin', 'M', 85),
 (8, 3, 'xiaoxin', 'F', 91),
 (9, 3, 'xiaowang', 'M', 89),
 (10, 3, 'xiaoli', 'F', 85)]

In [46]:
%sql select * from classes;
# SELECT * FROM <表名>可以查询一个表的所有行和所有列的数据

 * mysql://root:***@localhost/test
4 rows affected.

[(1, 'yiban'), (2, 'erban'), (3, 'sanban'), (4, 'siban')]

In [45]:
%sql select 100+200
# 计算100+200。
# 用来判断当前到数据库的连接是否有效。许多检测工具会执行一条SELECT 1;来测试数据库连接。

 * mysql://root:***@localhost/test
1 rows affected.

[(300,)]

## 条件查询

`SELECT * FROM <表名> WHERE <条件表达式>`

In [47]:
%sql select * from students where score >=80;
# score是列名

 * mysql://root:***@localhost/test
8 rows affected.

[(1, 1, 'xiaoming', 'M', 90),
 (2, 1, 'xiaohong', 'F', 95),
 (3, 1, 'xiaojun', 'M', 88),
 (5, 2, 'xiaobai', 'F', 81),
 (7, 2, 'xiaolin', 'M', 85),
 (8, 3, 'xiaoxin', 'F', 91),
 (9, 3, 'xiaowang', 'M', 89),
 (10, 3, 'xiaoli', 'F', 85)]

将整个单元格标记为SQL块,可以执行一组SQL语句.

下个cell中两种写法都可以

In [51]:
%%sql
SELECT * FROM students WHERE SCORE >=80;
SELECT * FROM students 
WHERE SCORE >=80

 * mysql://root:***@localhost/test
8 rows affected.
8 rows affected.

[(1, 1, 'xiaoming', 'M', 90),
 (2, 1, 'xiaohong', 'F', 95),
 (3, 1, 'xiaojun', 'M', 88),
 (5, 2, 'xiaobai', 'F', 81),
 (7, 2, 'xiaolin', 'M', 85),
 (8, 3, 'xiaoxin', 'F', 91),
 (9, 3, 'xiaowang', 'M', 89),
 (10, 3, 'xiaoli', 'F', 85)]

V是表students的别名，没有的话会报错

In [33]:
%%sql
SELECT * FROM students
V WHERE V.class_id <=2

 * mysql://root:***@localhost/test
7 rows affected.

[(1, 1, 'xiaoming', 'M', 90),
 (2, 1, 'xiaohong', 'F', 95),
 (3, 1, 'xiaojun', 'M', 88),
 (4, 1, 'xiaomi', 'F', 73),
 (5, 2, 'xiaobai', 'F', 81),
 (6, 2, 'xiaobing', 'M', 55),
 (7, 2, 'xiaolin', 'M', 85)]

### 多个条件并存

#### <条件1> AND <条件2>

In [52]:
%sql select * from students where score >=80 and gender = 'M';

 * mysql://root:***@localhost/test
4 rows affected.

[(1, 1, 'xiaoming', 'M', 90),
 (3, 1, 'xiaojun', 'M', 88),
 (7, 2, 'xiaolin', 'M', 85),
 (9, 3, 'xiaowang', 'M', 89)]

字符串用单引号

In [53]:
%%sql

SELECT * FROM students WHERE score >= 80 AND gender = 'M';

 * mysql://root:***@localhost/test
4 rows affected.

[(1, 1, 'xiaoming', 'M', 90),
 (3, 1, 'xiaojun', 'M', 88),
 (7, 2, 'xiaolin', 'M', 85),
 (9, 3, 'xiaowang', 'M', 89)]

#### <条件1> OR <条件2>

In [54]:
%sql select * from students where score >=80 or gender = 'M';

 * mysql://root:***@localhost/test
9 rows affected.

[(1, 1, 'xiaoming', 'M', 90),
 (2, 1, 'xiaohong', 'F', 95),
 (3, 1, 'xiaojun', 'M', 88),
 (5, 2, 'xiaobai', 'F', 81),
 (6, 2, 'xiaobing', 'M', 55),
 (7, 2, 'xiaolin', 'M', 85),
 (8, 3, 'xiaoxin', 'F', 91),
 (9, 3, 'xiaowang', 'M', 89),
 (10, 3, 'xiaoli', 'F', 85)]

In [55]:
%%sql

SELECT * FROM students WHERE score >= 80 OR gender = 'M';

 * mysql://root:***@localhost/test
9 rows affected.

[(1, 1, 'xiaoming', 'M', 90),
 (2, 1, 'xiaohong', 'F', 95),
 (3, 1, 'xiaojun', 'M', 88),
 (5, 2, 'xiaobai', 'F', 81),
 (6, 2, 'xiaobing', 'M', 55),
 (7, 2, 'xiaolin', 'M', 85),
 (8, 3, 'xiaoxin', 'F', 91),
 (9, 3, 'xiaowang', 'M', 89),
 (10, 3, 'xiaoli', 'F', 85)]

#### NOT <条件>

In [56]:
%sql select * from students where not class_id = 2;

 * mysql://root:***@localhost/test
7 rows affected.

[(1, 1, 'xiaoming', 'M', 90),
 (2, 1, 'xiaohong', 'F', 95),
 (3, 1, 'xiaojun', 'M', 88),
 (4, 1, 'xiaomi', 'F', 73),
 (8, 3, 'xiaoxin', 'F', 91),
 (9, 3, 'xiaowang', 'M', 89),
 (10, 3, 'xiaoli', 'F', 85)]

In [58]:
%sql select * from students where class_id <> 2;
# NOT class_id = 2其实等价于class_id <> 2.因此，NOT查询不是很常用。

 * mysql://root:***@localhost/test
7 rows affected.

[(1, 1, 'xiaoming', 'M', 90),
 (2, 1, 'xiaohong', 'F', 95),
 (3, 1, 'xiaojun', 'M', 88),
 (4, 1, 'xiaomi', 'F', 73),
 (8, 3, 'xiaoxin', 'F', 91),
 (9, 3, 'xiaowang', 'M', 89),
 (10, 3, 'xiaoli', 'F', 85)]

In [57]:
%%sql

SELECT * FROM students WHERE NOT class_id = 2;

 * mysql://root:***@localhost/test
7 rows affected.

[(1, 1, 'xiaoming', 'M', 90),
 (2, 1, 'xiaohong', 'F', 95),
 (3, 1, 'xiaojun', 'M', 88),
 (4, 1, 'xiaomi', 'F', 73),
 (8, 3, 'xiaoxin', 'F', 91),
 (9, 3, 'xiaowang', 'M', 89),
 (10, 3, 'xiaoli', 'F', 85)]

组合三个或者更多的条件，就需要用小括号()表示如何进行条件运算

In [60]:
%sql select * from students where (score < 80 or score > 90) and gender = 'M';
# 如果不加括号，条件运算按照NOT、AND、OR的优先级进行，
# 即NOT优先级最高，其次是AND，最后是OR。加上括号可以改变优先级。

 * mysql://root:***@localhost/test
1 rows affected.

[(6, 2, 'xiaobing', 'M', 55)]

In [59]:
%%sql

SELECT * FROM students WHERE (score < 80 OR score > 90) AND gender = 'M';

 * mysql://root:***@localhost/test
1 rows affected.

[(6, 2, 'xiaobing', 'M', 55)]

### 常用的条件表达式

|条件|表达式举例1|表达式举例2|说明|
|----|----|----|----|
|使用=判断相等|score = 80	|name = 'abc'|字符串需要用单引号括起来|
|使用>判断大于|score > 80	|name > 'abc'|字符串比较根据ASCII码，中文字符比较根据数据库设置|
|使用>=判断大于或相等|score >= 80|name >= 'abc'|空|
|使用<判断小于|score < 80|	name <= 'abc'|空|
|使用<=判断小于或相等|score <= 80|name <= 'abc'|空|
|使用<>判断不相等|score <> 80|name <> 'abc'|空|
|使用LIKE判断相似|name LIKE 'ab%'	|name LIKE '%bc%'|%表示任意字符，例如'ab%'将匹配'ab'，'abc'，'abcd'|

## 投影查询

只返回某些列的数据，而不是所有列的数据，我们可以用`SELECT 列1, 列2, 列3 FROM ...`，让结果集仅包含指定列

In [61]:
# 从students表中返回id、score和name这三列
%sql select id,score,name from students;

 * mysql://root:***@localhost/test
10 rows affected.

[(1, 90, 'xiaoming'),
 (2, 95, 'xiaohong'),
 (3, 88, 'xiaojun'),
 (4, 73, 'xiaomi'),
 (5, 81, 'xiaobai'),
 (6, 55, 'xiaobing'),
 (7, 85, 'xiaolin'),
 (8, 91, 'xiaoxin'),
 (9, 89, 'xiaowang'),
 (10, 85, 'xiaoli')]

In [62]:
%%sql 

select id,score,name from students;

 * mysql://root:***@localhost/test
10 rows affected.

[(1, 90, 'xiaoming'),
 (2, 95, 'xiaohong'),
 (3, 88, 'xiaojun'),
 (4, 73, 'xiaomi'),
 (5, 81, 'xiaobai'),
 (6, 55, 'xiaobing'),
 (7, 85, 'xiaolin'),
 (8, 91, 'xiaoxin'),
 (9, 89, 'xiaowang'),
 (10, 85, 'xiaoli')]

`SELECT 列1 别名1, 列2 别名2, 列3 别名3 FROM ...`

In [64]:
%sql select id, score points, name from students;
# 将列名score重命名为points，而id和name列名保持不变

 * mysql://root:***@localhost/test
10 rows affected.

[(1, 90, 'xiaoming'),
 (2, 95, 'xiaohong'),
 (3, 88, 'xiaojun'),
 (4, 73, 'xiaomi'),
 (5, 81, 'xiaobai'),
 (6, 55, 'xiaobing'),
 (7, 85, 'xiaolin'),
 (8, 91, 'xiaoxin'),
 (9, 89, 'xiaowang'),
 (10, 85, 'xiaoli')]

In [63]:
%%sql

SELECT id, score points, name FROM students;

 * mysql://root:***@localhost/test
10 rows affected.

[(1, 90, 'xiaoming'),
 (2, 95, 'xiaohong'),
 (3, 88, 'xiaojun'),
 (4, 73, 'xiaomi'),
 (5, 81, 'xiaobai'),
 (6, 55, 'xiaobing'),
 (7, 85, 'xiaolin'),
 (8, 91, 'xiaoxin'),
 (9, 89, 'xiaowang'),
 (10, 85, 'xiaoli')]

# sql转pandas

In [20]:
result = %sql select * from test.students limit 5
result

 * mysql://root:***@localhost/test
5 rows affected.

[(1, 1, 'xiaoming', 'M', 90),
 (2, 1, 'xiaohong', 'F', 95),
 (3, 1, 'xiaojun', 'M', 88),
 (4, 1, 'xiaomi', 'F', 73),
 (5, 2, 'xiaobai', 'F', 81)]

In [25]:
tmp = result.DataFrame()  # 转化sql到DF
tmp

   id  class_id      name gender  score
0   1         1  xiaoming      M     90
1   2         1  xiaohong      F     95
2   3         1   xiaojun      M     88
3   4         1    xiaomi      F     73
4   5         2   xiaobai      F     81

In [26]:
type(tmp)

pandas.core.frame.DataFrame

In [24]:
type(result)

sql.run.ResultSet

# 基本概念

关系模型本质上就是若干个存储数据的**二维表**，可以把它们看作很多Excel表。

表的每一**行**称为**记录**（`Record`），记录是一个逻辑意义上的数据。

表的每一**列**称为**字段**（`Column`），同一个表的每一行记录都拥有相同的若干字段。

- 字段定义了数据类型（整型、浮点型、字符串、日期等），以及是否允许为`NULL`。注意`NULL`表示字段数据不存在。一个整型字段如果为`NULL`不表示它的值为`0`，同样的，一个字符串型字段为`NULL`也不表示它的值为空串`''`。

**通常情况下，字段应该避免允许为`NULL`。不允许为`NULL`可以简化查询条件，加快查询速度，也利于应用程序读取数据后无需判断是否为`NULL`。**

和Excel表有所不同的是，关系数据库的表和表之间需要建立“一对多”，“多对一”和“一对一”的关系，这样才能够按照应用程序的逻辑来组织和存储数据。

在关系数据库中，关系是通过主键和外键来维护的。

----

**主键**：在一个数据库表中唯一标识每个行/记录表中的一个字段。 主键必须包含唯一值。 如果一个表有任何字段定义为主键，那么就不能有两个记录具有字段的值相同。

- 记录一旦插入到表中，主键最好不要再修改，因为主键是用来唯一定位记录的，修改了主键，会造成一系列的影响。

- 选取主键的一个基本原则是：不使用任何业务相关的字段作为主键。因此，身份证号、手机号、邮箱地址这些看上去可以唯一的字段，均不可用作主键。

- 主键最好是完全业务无关的字段，我们一般把这个字段命名为id。常见的可作为id字段的类型有：
    - 自增整数类型：数据库会在插入数据时自动为每一条记录分配一个自增整数，这样我们就完全不用担心主键重复，也不用自己预先生成主键；
    - 全局唯一GUID类型：使用一种全局唯一的字符串作为主键，类似`8f55d96b-8acc-4636-8cb8-76bf8abc2f57`。GUID算法通过网卡MAC地址、时间戳和随机数保证任意计算机在任意时间生成的字符串都是不同的，大部分编程语言都内置了GUID算法，可以自己预算出主键。
    
**联合主键**：关系数据库允许通过**多个字段**唯一标识记录，即两个或更多的字段都设置为主键。联合主键，允许一列中的取值有重复，只要不是所有主键列的取值都重复即可。联合主键并不常用。

---

**外键**：通过该字段将两个表联系起来。既可以通过数据库来约束，也可以不设置约束，仅依靠应用程序的逻辑来保证。

由于外键约束会降低数据库的性能，大部分互联网应用程序为了追求速度，并不设置外键约束，而是仅靠应用程序自身来保证逻辑的正确性。这种情况下，class_id仅仅是一个普通的列，只是它起到了外键的作用而已。

---

**多对多**：通过两个一对多关系实现的，即通过一个中间表，关联两个一对多关系，就形成了多对多关系。例如，一个老师可以对应多个班级，一个班级也可以对应多个老师，因此，班级表和老师表存在多对多关系。

**一对一**：一个表的记录对应到另一个表的唯一一个记录。例如，`students`表的每个学生可以有自己的联系方式，如果把联系方式存入另一个表`contacts`，我们就可以得到一个“一对一”关系.如果业务允许，完全可以把两个表合为一个表。但是，有些时候，如果某个学生没有手机号，那么，`contacts`表就不存在对应的记录。实际上，一对一关系准确地说，是`contacts`表一对一对应`students`表。

**索引**：关系数据库中对**某一列或多个列**的值进行**预排序**的数据结构。通过使用索引，可以让数据库系统**不必扫描整个表**，而是直接定位到符合条件的记录，这样就大大加快了查询速度。

- 索引列的值如果越互不相同，那么索引效率越高。
- 索引的优点是提高了查询效率，缺点是在插入、更新和删除记录时，需要同时修改索引，因此，索引越多，插入、更新和删除记录的速度就越慢。

- 对于主键，关系数据库会自动对其创建主键索引。使用主键索引的效率是最高的，因为主键会保证绝对唯一。
    
    
```
ALTER TABLE students
ADD INDEX idx_name_score (name, score);  # 创建了一个名称为idx_score，使用列name,score的索引
```

---

**唯一索引**

```
ALTER TABLE students
ADD UNIQUE INDEX uni_name (name);  # 通过UNIQUE关键字我们就添加了一个唯一索引。

# 也可以只对某一列添加一个唯一约束而不创建唯一索引
ALTER TABLE students
ADD CONSTRAINT uni_name UNIQUE (name);  #name列没有索引，但仍然具有唯一性保证
```